Revit 2027 API
BuiltInFailures.ScheduleViewFailures.SchedulesCanBePlacedOnSheetsOnly Property
 Schedules can only be placed on Sheets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SchedulesCanBePlacedOnSheetsOnly { get; }
Public Shared ReadOnly Property SchedulesCanBePlacedOnSheetsOnly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SchedulesCanBePlacedOnSheetsOnly {
	FailureDefinitionId^ get ();
}
static member SchedulesCanBePlacedOnSheetsOnly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace